National_bank_xml/MT910encrypted_signed.xml

<?xml version="1.0" encoding="UTF-8" standalone="no"?><SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"><SOAP-ENV:Header/><SOAP-ENV:Body><ns3:getMt910RequestMt102 xmlns:ns2="http://strukturaRtgsNaloga.xml.com" xmlns:ns3="http://mt102.xml.com"><xenc:EncryptedData xmlns:xenc="http://www.w3.org/2001/04/xmlenc#" Type="http://www.w3.org/2001/04/xmlenc#Content"><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#tripledes-cbc"/><ds:KeyInfo xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:KeyName>Sifrovan tajni kljuc</ds:KeyName>
<xenc:EncryptedKey><xenc:EncryptionMethod Algorithm="http://www.w3.org/2001/04/xmlenc#rsa-1_5"/><xenc:CipherData><xenc:CipherValue>N1jlELLrHwNTHPdd2oiX1zWEUnYs3m4DAFC6rmTvFwZyMU5dTfBsltNn6vLF77XqtjwiZ7NNm8ss&#13;
ZZcRdUnZvpapMAdmv4Fs40MnCNAqwVsE3kiQmokXTB0xHMPSzS0gUdBTkbQ5sGPhi6WXOL/aMiUV&#13;
EC7ETbwFU7ciUG3Dw8AoedOWTCAlDbLO8DgAaEOrRAVzyQ0dOYfuGR18uTTsOrAaB5Yu6EhDKZtg&#13;
lj+7Lj6pVHoNLPlZfkUImjTjE6RpDfr0E+q4+kJxxDVFd9M8ruTx3G3za5rgtr9bghmvT+KUkpCa&#13;
GhQL7MHuoZyhXbP+62dELgxijkuJETdLQnLFag==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedKey></ds:KeyInfo><xenc:CipherData><xenc:CipherValue>IkkJcdv0b70A6wi7XAQj/3FemQ6VOb/B2nRxg8rLQ3/aFE8P7UCGsD1PeL0jpDLhBZJF3nbt+6/8&#13;
1zdEKKqWV0kjCvr5tyMYWn6yCXzuMKpHjgqryQtcCnmnkRnmGSsA76AK9ZHSNE4+tR/mV9X+ewUl&#13;
5nadNbf2tQrbX3/zG93aIRjGwMCStuifZpakZMyVxTN9ByxTcgKyVIreV0oC1bQJCvftcQ29H3qF&#13;
FMzwKoTUqG03xaP1VHET3M1lCIqFaLVc9sGrveWqHJfboPcNGA1DNvU3CzWCLm3v6QOQudZOyqT/&#13;
jqufqI3m7dbZk9ndncVOqElMABvKQZc5KiPexffcGsYdG9aSi3ARFr0TRpm8NPpVprPH4Ds30n6s&#13;
T7VO6SUYKe8ZTqJ0hSW7FcLC6sCbpFUk4JLUQ6t0nUKjX1mPMBl9hIQ/Odt2HHgBq4gQsn5KrzwK&#13;
213wZINa3Ht3RC6/xmXEjiiRgSlAjv30pw11kt5mnhf/gta3wXznNSn+H25gU+XdZ5K/29sC3pjK&#13;
jZ9Fi5ibgA7O0QLatY/U8kqFHPs9M1vHKFZ/2Me0VJEvMx/YrCzHgfbGTL9RpoOpTtMHVPuYJ8M1&#13;
rQWZFi/pm9Ut+NDMUcLPHguqg4ZCNdkTP0xwYEeNizanO3YtAW4DFF1HD6MK6bwVIon6c+/CTvly&#13;
tZnRR6H8cGV4kyvHX55rlP5u07Utm5Xa4b7QRHtakW3Ma1v26NwtLVwaHMfBfogOml4JsWb7KGmN&#13;
uB1EEP5Z+PzIXo65T+NHuFcHuMTMdqxuVsfSuZMcI2VC8lijufIooW9/LPf2NgtKV0L4s+P8twqS&#13;
2mAdlPCj1thB2F5q2emBaBFx60ru8DxLAX+yaEkIpYvZGCJd8cuEjRaocvN8Xld8a/VVlqs7gY3a&#13;
T0C9u20Q6oRCBc5Gij5Tp8oCA9qiU7rY6zUK7agI3Wp555kiCic/EcTuZJz9bsYS5dHB9x/zTiak&#13;
MIKCLw77KNsrDlCbGADIAdLa+BiIC61e3yMUjuR9af/Bq/SdXoXbAtSBA4twTTndhiifolaVoYhI&#13;
UuCDnxW3xwPrQ1Yznvyz5zDW6XwLSSt3jsbFqoZEzlUCwtztr2YDEGnOy5A4hzyATujk/RQlUKY0&#13;
FBtPVKPdPPHZdNDeQiAajdOuGFTKLLkxhkU503Icsu6rA5dDg2PWtUx5NOwyHStA3uahEKYTH/hI&#13;
nZCL/M9ozPAgN16heV6yz7r89DyQVbEaKHZPE1lpde2omVVInTNaIwxLWczJhYU5WhzNX1vHsVTu&#13;
DhdDM+v3qaw6dtlSDDSOx3vSWaGfyv2qp6goWcmn6V1DkLiYzMkk0pk/W/Pfmjb1CL9PdJxmry/3&#13;
aGAZqsfrM4IxNpDftnQTjlIdwMxOxSC2unkOEkSvebR6jhbiM4Mcxg1YuwUeDHrf9KP9GwgY0okz&#13;
FrIBxEiK+Ivg68HiM6Xcnd2nddxQLmMtyeJtZY+s7S1O2421gbWva2Swsl+E6/JaqO9M47DrOVEl&#13;
a/HopaCr+cWDzwBiFXOmTcXGCDYk7R/oDgQp6aExoQz9kiNxhcLa1uo29IoRCS6lJtULjbhnJxVV&#13;
RMYxm6dmgR7ZFYMGbB6Jpt4IqGWUUDLpAi8T8LazusgXTidl38i1WhNpkWkD/rYyRWRab8sDCKj6&#13;
gZGhP8Y86cotEVEjoWCPHqH3QJSgPTEv2B4nF+Vw8mTB+D6nHL2qgiOvgmIpHlri1SYIpZz2ulyu&#13;
V7d3Gk9GWiZ9XwP28dKdIG84QeWWYKnhnHC7HVA8NP2GRDr+zq2yVuJXezdf6wPS6/f0aY7pP6cj&#13;
Wn7TdgG0fFrC+TKqbQ0WSkG+OAOnTdG4JrBy2rlAsACZ8eQoeLTWoAysB6prw8B/vDmREfpUzgzZ&#13;
btlZT4nAg8CkEBLPvDRPQoDySUThMdtmxfq4fr2n5AZC/IQo7vmi5c6iQcXEkVv0QLbKxouugSRK&#13;
eGWKRvYLDAGItresL3lgGS/od/DQCuBYkurFRxzD2zFim+HJvFzUn/ujyqu3/DTQFGfGb4BjxEJ4&#13;
60NMx9unZvBfvBJBawaYewDUUZ6JLh07kRsK42yr4snJJLmP3S6cirvF45UIIx+e38A1F/x7ATxr&#13;
Mp0s1g==</xenc:CipherValue></xenc:CipherData></xenc:EncryptedData></ns3:getMt910RequestMt102></SOAP-ENV:Body><ds:Signature xmlns:ds="http://www.w3.org/2000/09/xmldsig#">
<ds:SignedInfo>
<ds:CanonicalizationMethod Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315"/>
<ds:SignatureMethod Algorithm="http://www.w3.org/2000/09/xmldsig#rsa-sha1"/>
<ds:Reference URI="">
<ds:Transforms>
<ds:Transform Algorithm="http://www.w3.org/2000/09/xmldsig#enveloped-signature"/>
<ds:Transform Algorithm="http://www.w3.org/TR/2001/REC-xml-c14n-20010315#WithComments"/>
</ds:Transforms>
<ds:DigestMethod Algorithm="http://www.w3.org/2000/09/xmldsig#sha1"/>
<ds:DigestValue>SNBIw7q+f/IhQptAbtS4EPxulAs=</ds:DigestValue>
</ds:Reference>
</ds:SignedInfo>
<ds:SignatureValue>
EOqdgCTzRWtwDL8onu+wNLNqUYT/zUya119+Kc2nIrL/4YqymoJuD3bdIH+9AC8NX4qGl+Zk5jQM&#13;
RxkguSy1YfNAGGIOFCgsyU/IilvbWoKcaeW3hYI/rxp7Hx+vmlGX0crBD6RG44yVYFRGrejjet1z&#13;
7EUoRdI5bjMeMtebZYirthZHLu45hjs7uk1JdXlTa90hyMNrNdoDoSZ3I/WkovNEBuAdavfgTYBz&#13;
K+jNJZfVIBfBsBENRefaMqCilqwTyNVQIHa8mAjnpicWzQfCbSXNfC8vLCl44aoLnhMw6V0QQkZ8&#13;
F/5QNPXvz22Q2yOAIWrDqnmEVP0miEJjyg3ebA==
</ds:SignatureValue>
<ds:KeyInfo>
<ds:KeyValue>
<ds:RSAKeyValue>
<ds:Modulus>
iB4brM9IcSzO94vsP2oklqN2bnPRIj4WnkokiLR4pwUiZPDwNOmz8VXfq73I6HA1++WGYMTxBwwi&#13;
YTWlCvBBGoN/iKQNY31bk/8ybvHCH+jfLuMe6LGkOzqiXKOARR+13D4/55JmhGIry6ZaUHNnBEQw&#13;
oO9I30t90tLf+t2+AJUes1cRv8bbXtkoiykA4ZGdT+xaB8t41LIdNIRFNYaupGQPs3td7xZn7kJd&#13;
nEv2KIma8gOlDDkr8M2TARRmbcLSsr4MPXosIalThZE8Nt5l/zRQiRM9pSW2zAVAqQ/frLf8ZZuS&#13;
TQwy1wt+OJ4DX+DVcya9ONNRNXvfCMGyxdheyw==
</ds:Modulus>
<ds:Exponent>AQAB</ds:Exponent>
</ds:RSAKeyValue>
</ds:KeyValue>
<ds:X509Data>
<ds:X509Certificate>
MIIDyDCCArCgAwIBAgIEWUhQjjANBgkqhkiG9w0BAQsFADCBlDEWMBQGA1UEAwwNTmFyb2RuYSBi&#13;
YW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2RuYSBiYW5rYTEMMAoG&#13;
A1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEaMBgGCgmSJomT8ixk&#13;
AQEMCjE0OTc5MTE0MzgwHhcNMTcwNjE5MDAwMDAwWhcNMTgwNjE5MDAwMDAwWjCBlDEWMBQGA1UE&#13;
AwwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECgwNTmFyb2RuYSBiYW5rYTEWMBQGA1UECwwNTmFyb2Ru&#13;
YSBiYW5rYTEMMAoGA1UEBhMDc3JiMSAwHgYJKoZIhvcNAQkBFhFuYXJvZG5hQGJhbmthLmNvbTEa&#13;
MBgGCgmSJomT8ixkAQEMCjE0OTc5MTE0MzgwggEiMA0GCSqGSIb3DQEBAQUAA4IBDwAwggEKAoIB&#13;
AQCIHhusz0hxLM73i+w/aiSWo3Zuc9EiPhaeSiSItHinBSJk8PA06bPxVd+rvcjocDX75YZgxPEH&#13;
DCJhNaUK8EEag3+IpA1jfVuT/zJu8cIf6N8u4x7osaQ7OqJco4BFH7XcPj/nkmaEYivLplpQc2cE&#13;
RDCg70jfS33S0t/63b4AlR6zVxG/xtte2SiLKQDhkZ1P7FoHy3jUsh00hEU1hq6kZA+ze13vFmfu&#13;
Ql2cS/YoiZryA6UMOSvwzZMBFGZtwtKyvgw9eiwhqVOFkTw23mX/NFCJEz2lJbbMBUCpD9+st/xl&#13;
m5JNDDLXC344ngNf4NVzJr0401E1e98IwbLF2F7LAgMBAAGjIDAeMA8GA1UdEwEB/wQFMAMBAf8w&#13;
CwYDVR0PBAQDAgH2MA0GCSqGSIb3DQEBCwUAA4IBAQBKgkCxBNwHmG/wEYU8Od6HkxihXWPj1h12&#13;
fG+q61jmb4fYSRfJ0izYvn5nrXht+WQh/TSDoR5b/FyKbjwyTqT14F+SduxLVKQ2SEdeO/nvHE3r&#13;
nQBV4fRejhZU5tfX6L5axwh33CP+S1BJ/hVzF5q2gctUkL4lCcfvcjk+ybKoi0+d4xuavtHrdfc8&#13;
B3R5xQoJHpWijNLg0JQn76/9gt1GMvBduxBUB1RE32w0+mWlCI1aQEOcM69rXRgRW6BWWP1GyMGr&#13;
YeOsFn5vAOQWf2es2a7JbPdCz78z61ULiljUXSYC60ihwwBCoC0ehlp1itw6xPMtT2xlzvAZ2a+l&#13;
miTA
</ds:X509Certificate>
</ds:X509Data>
</ds:KeyInfo>
</ds:Signature></SOAP-ENV:Envelope>